list1 = ["张三", "李四", "王五"]

"""
insert()：指定位置插入数据，插入位置后面数据的位置后移，插入后返回None
如果插入位置大于列表长度，默认插入末尾

append() 列表末尾追加任何类型数据，和extend不一样就是append()不做拆分

extend() 列表末尾追加任何类型数据，如果新添加数据为列表，则拆分再添加到列表里
"""

insert = list1.insert(1, "赵六")  #
print(list1)  # ['张三', '赵六', '李四', '王五']
print(insert)  # None

print(len(list1))  # 4 len()获取长度

list1.append("小龙女")
print(list1)  # ['张三', '赵六', '李四', '王五', '小龙女']

list1.append(["杨过", "张三丰"])
print(list1)  # ['张三', '赵六', '李四', '王五', '小龙女', ['杨过', '张三丰']]

list1.extend(["白龙马", "师傅"])
print(list1)  # ['张三', '赵六', '李四', '王五', '小龙女', ['杨过', '张三丰'], '白龙马', '师傅']
