# 元组tuple

## 直接创建元组
t1 = ("A", "B", "C")
print(t1)

## 只有一个数据，必须加上逗号,
t2 = ("A",)

## 通过range创建元组
t3 = tuple(range(5))  # (0, 1, 2, 3, 4)
print(t3)

## 元组没有推导式，但会返回一个可迭代对象
t4 = (i for i in range(10) if i % 2 == 0)
for i in t4:
    print(i)

## index获取元组中指定元素小标，如果没有则报错
t5 = ("A", "B", "C")
print("index=%s" % t5.index("B"))

## 元组中的元素不能修改
t6 = ("A", "B", "C")
print(t6[1])  # 或者元组中指定位置数据

# t6[1] = "BB"  # 修改报错

t7 = ("A", "B", [10, 20, 30])
# 下面可以改变
t7[2][0] = 100  ## t7[2]元素元素不可变，但是t7[2][0]是修改列表中数据，元组t7[2]地址还是没有改变
print(t7)

## count(num) 返回指定元素个数
print("元素个数=%d" % t7.count("B"))    # 结果B出现1次
