'''
输出print
常用%占位符
%d 有符号十进制整数
%s 通过str()字符串转换格式
%f 浮点数类型占位符
%.2f表示保留2位小数
'''

age = 18
name = "张三"
pi = 3.1415926

#占位符输出一个变量值
print("姓名：%s" %name) #姓名：张三
print("年龄:%d" %age) #年龄:18

#占位符输出多个变量值，括号
print("姓名:%s,年龄:%d" % (name,age)) #姓名:张三,年龄:18
print("PI=%.2f" %pi) #PI=3.14


###########################输出换行#############################
#print函数默认换行,我们可以修改换行符，如下
print("hello", end="\n")
print("hello", end=" ")
print("hello", end="...")
print("hello")

#以上print运行结果
'''
hello
hello hello...hello
'''

###########字符串可以通过+号拼接##############
print("hello " + name) #hello 张三

############输出可以不使用括号，但是不建议#############